{"class_name": "Sequential", "keras_version": "2.0.4", "config": [{"class_name": "Merge", "config": {"layers": [{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_219", "dtype": "int32", "output_dim": 300, "trainable": false, "embeddings_regularizer": null, "input_dim": 2318, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 56], "activity_regularizer": null, "input_length": 56}}]}, {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_220", "dtype": "int32", "output_dim": 300, "trainable": false, "embeddings_regularizer": null, "input_dim": 2318, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 56], "activity_regularizer": null, "input_length": 56}}]}], "name": "merge_220", "concat_axis": -1, "arguments": {}, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "output_shape_type": "raw", "output_mask": null, "output_shape": null, "mode": "concat"}}, {"class_name": "Dropout", "config": {"dtype": "float32", "batch_input_shape": [null, 56, 600], "trainable": true, "name": "dropout_219", "rate": 0.5}}, {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 56, 600], "name": "input_110", "sparse": false}, "name": "input_110"}, {"class_name": "Conv1D", "inbound_nodes": [[["input_110", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_982", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "name": "conv1d_982"}, {"class_name": "Conv1D", "inbound_nodes": [[["input_110", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_985", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4]}, "name": "conv1d_985"}, {"class_name": "Conv1D", "inbound_nodes": [[["input_110", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_988", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5]}, "name": "conv1d_988"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_982", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_982", "pool_size": [2]}, "name": "max_pooling1d_982"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_985", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_985", "pool_size": [2]}, "name": "max_pooling1d_985"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_988", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_988", "pool_size": [2]}, "name": "max_pooling1d_988"}, {"class_name": "Conv1D", "inbound_nodes": [[["max_pooling1d_982", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_983", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "name": "conv1d_983"}, {"class_name": "Conv1D", "inbound_nodes": [[["max_pooling1d_985", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_986", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4]}, "name": "conv1d_986"}, {"class_name": "Conv1D", "inbound_nodes": [[["max_pooling1d_988", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_989", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5]}, "name": "conv1d_989"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_983", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_983", "pool_size": [2]}, "name": "max_pooling1d_983"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_986", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_986", "pool_size": [2]}, "name": "max_pooling1d_986"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_989", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_989", "pool_size": [2]}, "name": "max_pooling1d_989"}, {"class_name": "Conv1D", "inbound_nodes": [[["max_pooling1d_983", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_984", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "name": "conv1d_984"}, {"class_name": "Conv1D", "inbound_nodes": [[["max_pooling1d_986", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_987", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [4]}, "name": "conv1d_987"}, {"class_name": "Conv1D", "inbound_nodes": [[["max_pooling1d_989", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_990", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 100, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [5]}, "name": "conv1d_990"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_984", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_984", "pool_size": [2]}, "name": "max_pooling1d_984"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_987", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_987", "pool_size": [2]}, "name": "max_pooling1d_987"}, {"class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_990", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_990", "pool_size": [2]}, "name": "max_pooling1d_990"}, {"class_name": "Flatten", "inbound_nodes": [[["max_pooling1d_984", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_328"}, "name": "flatten_328"}, {"class_name": "Flatten", "inbound_nodes": [[["max_pooling1d_987", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_329"}, "name": "flatten_329"}, {"class_name": "Flatten", "inbound_nodes": [[["max_pooling1d_990", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_330"}, "name": "flatten_330"}, {"class_name": "Merge", "inbound_nodes": [[["flatten_328", 0, 0, {}], ["flatten_329", 0, 0, {}], ["flatten_330", 0, 0, {}]]], "config": {"name": "merge_219", "concat_axis": -1, "output_shape_type": "raw", "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "output_shape": null, "mode": "concat"}, "name": "merge_219"}], "input_layers": [["input_110", 0, 0]], "name": "model_110", "output_layers": [["merge_219", 0, 0]]}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_219", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 150, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "trainable": true, "name": "dropout_220"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_110"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_220", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}}], "backend": "tensorflow"}